In [1]:
import pandas
# create a data dataframe
data = pandas.read_csv('bank.csv')
data

,Loan_ID,Gender,Married,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Property_Area,Loan_Status
0,LP001002,Male,No,Graduate,No,5849,0.0,NaN,Urban,Y
1,LP001003,Male,Yes,Graduate,No,4583,1508.0,128.0,Rural,N
2,LP001005,Male,Yes,Graduate,Yes,3000,0.0,66.0,Urban,Y
3,LP001006,Male,Yes,Not Graduate,No,2583,2358.0,120.0,Urban,Y
4,LP001008,Male,No,Graduate,No,6000,0.0,141.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,Graduate,No,2900,0.0,71.0,Rural,Y
610,LP002979,Male,Yes,Graduate,No,4106,0.0,40.0,Rural,Y
611,LP002983,Male,Yes,Graduate,No,8072,240.0,253.0,Urban,Y
612,LP002984,Male,Yes,Graduate,No,7583,0.0,187.0,Urban,Y
613,LP002990,Female,No,Graduate,Yes,4583,0.0,133.0,Semiurban,N

In [2]:
# access our data frame and provide column name as KEY.
data['Gender']
# We can do the same for other columns

0        Male
1        Male
2        Male
3        Male
4        Male
        ...
609    Female
610      Male
611      Male
612      Male
613    Female
Name: Gender, Length: 614, dtype: object

In [4]:
data[['Gender','Married','ApplicantIncome']]

     Gender Married  ApplicantIncome
0      Male      No             5849
1      Male     Yes             4583
2      Male     Yes             3000
3      Male     Yes             2583
4      Male      No             6000
..      ...     ...              ...
609  Female      No             2900
610    Male     Yes             4106
611    Male     Yes             8072
612    Male     Yes             7583
613  Female      No             4583

[614 rows x 3 columns]

In [5]:
# check empty cells 
data.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Property_Area         0
Loan_Status           0
dtype: int64

In [6]:
# fill self-employed column 
data['Self_Employed'].fillna('Unknown', inplace=True)

In [7]:
# CALCULATE MEAN OF LOANAMOUNT 
mean =data['LoanAmount'].mean()
mean

np.float64(146.41216216216216)

In [8]:
# CALCULATE MEDIAN OF LOANAMOUNT 
median = data['LoanAmount'].median()
median

np.float64(128.0)

In [9]:
# CALCULATE MODE OF LOANAMOUNT
mode = data['LoanAmount'].mode()
mode

0    120.0
Name: LoanAmount, dtype: float64

In [10]:
# fill the loanamount empty 
data['LoanAmount'].fillna(mean, inplace=True)

C:\Users\modcom\AppData\Local\Temp\ipykernel_2012\3330383175.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['LoanAmount'].fillna(mean, inplace=True)

In [11]:
# check empty cells 
data.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Property_Area        0
Loan_Status          0
dtype: int64